zzuzpb/virtual-sense/VirtualSense/platform/virtualsense/dev/_cc2520ll.c
/**
 * \file                cc2520ll.c
 *
 * \brief               Architecture-specific functions to interface the TI's CC2520 radio
 *
 * \author              Emanuele Lattanzi    <emanuele.lattanzi@uniurb.it>
 *
 */
#include "platform-conf.h"
#include "dev/cc2520ll.h"
#include "dev/radio.h"
#include "dev/spi_UCB1.h"
#include "power-interface.h"
#include "node-id.h"

/*
 * We include the "contiki-net.h" file to get all the network functions.
 */
#include "contiki-net.h"

/*----------------------------------------------------------------------------*/
/**
 * LOCAL VARIABLES
 */
static cc2520ll_cfg_t pConfig;
static u8_t rxMpdu[128];
static my_ringbuf_t rxBuffer;
static u8_t buffer[CC2520_BUF_LEN];
/*---------------------------------------------------------------------------*/
/*
 * We declare the process that we use to register with the TCP/IP stack,
 * and to check for incoming packets.
 */
PROCESS(radio_driver_process, "CC2520 radio_driver_process");
static volatile uint16_t last_packet_timestamp;
static uint8_t wasLPM2 = 0;
static uint8_t transmitting = 0, receiving = 0, rejected = 0;
static rtimer_clock_t last_sleep_time;
static rtimer_clock_t sfd_time;

/*
 * Recommended register settings which differ from the data sheet
 */
#define CCA_SLEEP_TIME                     RTIMER_ARCH_SECOND / 2000

static regVal_t regval[]= {

    /* Tuning settings */
#ifdef INCLUDE_PA
    CC2520_TXPOWER,     0xF9,       /* Max TX output power */
    CC2520_TXCTRL,      0xC1,
#else
    CC2520_TXPOWER,     0x2C,       /* Max TX output power 0xF7 low power is 0x2C (-7 dBm)  or 0x03 (-18 dBm)*/
#endif
    CC2520_CCACTRL0,    0xF8,       /* CCA threshold -80dBm */

    /* Recommended RX settings */
    CC2520_MDMCTRL0,    0x85, /*85*/
    CC2520_MDMCTRL1,    0x04, /*14*/
    CC2520_RXCTRL,      0x3F,
    CC2520_FSCTRL,      0x5A,
    CC2520_FSCAL1,      0x2B,
#ifdef WITH_FRAME_FILTERING
    CC2520_FRMFILT0,    0x01,                      /* enables frame filtering */
#else
    CC2520_FRMFILT0,    0x01,                      /* disables frame filtering */
#endif
#ifdef INCLUDE_PA
    CC2520_AGCCTRL1,    0x16,
#else
    CC2520_AGCCTRL1,    0x11,
#endif
    CC2520_ADCTEST0,    0x10,
    CC2520_ADCTEST1,    0x0E,
    CC2520_ADCTEST2,    0x03,

    /* Configuration for applications using cc2520ll_init() */
    CC2520_FRMCTRL0,    0x60,               /* auto crc and auto ack*/
    CC2520_EXTCLOCK,    0x00,
#ifdef WITH_FRAME_FILTERING
    CC2520_FIFOPCTRL,   0x01,				/* the lowest FIFOP threshold for frame filtering */
#endif
    CC2520_GPIOCTRL0,   1+CC2520_EXC_RX_FRM_DONE,
    CC2520_GPIOCTRL1,   CC2520_GPIO_SAMPLED_CCA,
    CC2520_GPIOCTRL2,   1+CC2520_EXC_TX_FRM_DONE,/*CC2520_GPIO_RSSI_VALID*/
#ifdef INCLUDE_PA
    CC2520_GPIOCTRL3,   CC2520_GPIO_HIGH,   /* CC2590 HGM */
    CC2520_GPIOCTRL4,   0x46,               /* EN set to lna_pd[1] inverted */
    CC2520_GPIOCTRL5,   0x47,               /* PAEN set to pa_pd inverted */
    CC2520_GPIOPOLARITY,0x0F,               /* Invert GPIO4 and GPIO5 */
#else
    CC2520_GPIOCTRL3,   CC2520_GPIO_SFD,
    CC2520_GPIOCTRL4,   CC2520_GPIO_RSSI_VALID/*CC2520_GPIO_SNIFFER_DATA*/,
    CC2520_GPIOCTRL5,   CC2520_GPIO_FIFOP/*CC2520_GPIO_SNIFFER_CLK*/,
#endif

};




/**
 * @fn      cc2520ll_waitRadioReady
 *
 * @brief   Wait for the crystal oscillator to stabilize.
 *
 * @param   none
 *
 * @return  SUCCESS if oscillator starts, FAILED otherwise
 */
/*----------------------------------------------------------------------------*/
static u8_t
cc2520ll_waitRadioReady(void)
{
  u8_t i;

  /* Wait for XOSC stable to be announced on the MISO pin */
  i = 200;
  CC2520_SPI_BEGIN();
  while (i > 0 && !(P5IN & (1 << CC2520_MISO_PIN))) {
    __delay_cycles(10*MSP430_USECOND);
    --i;
  }
  CC2520_SPI_END();

  return i > 0 ? SUCCESS : FAILED;
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_waitTransceiverReady
 *
 * @brief   Wait until the transceiver is ready (SFD low).
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_waitTransceiverReady(void)
{

  while (CC2520_SFD_PIN);

  //printf("Transceiver ready\n");
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_interfaceInit
 *
 * @brief   Initialises SPI interface to CC2520 and configures reset and vreg
 *          signals as MCU outputs.
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_interfaceInit(void)
{

	// Initialize the CC2520 interface
	CC2520_SPI_END();
	/* Initialize the CC2520 interface */
	P4OUT &= ~(1 << CC2520_RESET_PIN);
	P1OUT &= ~(1 << CC2520_VREG_EN_PIN);

	P4DIR |= (1 << CC2520_RESET_PIN);
	P1DIR |= (1 << CC2520_VREG_EN_PIN);

   /* Port 1.3 configuration GPIO 0 interrupt*/
	P1SEL &= ~(1 << CC2520_INT_PIN);
	P1OUT &= ~(1 << CC2520_INT_PIN);
	P1DIR &= ~(1 << CC2520_INT_PIN);
#ifdef WITH_FRAME_FILTERING
   /* Port 1.1 configuration GPIO 3 SFD interrupt for frame filtering*/
	P1SEL &= ~(1 << CC2520_SFD_INT_PIN);
	P1OUT &= ~(1 << CC2520_SFD_INT_PIN);
	P1DIR &= ~(1 << CC2520_SFD_INT_PIN);
#endif

	//configure other GPIO port
	CC2520_GPIO_DIR_OUT(1);
	CC2520_GPIO_DIR_OUT(2);
	CC2520_GPIO_DIR_OUT(3);
	CC2520_GPIO_DIR_OUT(4);
	CC2520_GPIO_DIR_OUT(5);


}
/*----------------------------------------------------------------------------*/

/**
 * @fn          cc2520ll_spiInit
 *
 * @brief       Initalise Radio SPI interface
 *
 * @param       none
 *
 * @return      none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_spiInit(void)
{
	spi_UCB1_init(0x0002);
}

/*----------------------------------------------------------------------------*/

/**
 * @fn          cc2520ll_spiClose
 *
 * @brief       close Radio SPI interface to reduce power consumption (i.e. current drayn between RF module
 * 				ad MCU)
 *
 * @param       none
 *
 * @return      none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_spiClose(void)
{
	/* Make sure SIMO is configured as output */
	/*P3DIR |= (1 << CC2520_SIMO_PIN);
	P3SEL |= (1 << CC2520_SIMO_PIN);*/
}

