zzuzpb/virtual-sense/VirtualSense/platform/virtualsense/dev/_cc2520ll.c
/*----------------------------------------------------------------------------*/

/**
 * @fn          cc2520ll_spiClose
 *
 * @brief       open Radio SPI interface
 *
 *
 * @param       none
 *
 * @return      none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_spiOpen(void)
{
	/* Configure SIMO as input */
	/*P3DIR &= ~(1 << CC2520_SIMO_PIN);*/
}
/*----------------------------------------------------------------------------*/

void switchToLPM2(){
	dint();
	// set CS= 1
	/* Raise CS */
	P4OUT |= (1 << CC2520_CS_PIN);
	// set reset = 0;
	P4OUT &= ~(1 << CC2520_RESET_PIN);
	// set GPIO5 = 0;
	//CC2520_GPIO_CLOSE(5);
	// set VREG_EN = 0;
	P1OUT &= ~(1 << CC2520_VREG_EN_PIN);
	// need reconfiguration

	// open transistor isolate CC2520
	CC2520_POWER_DOWN();

	wasLPM2 = 1;
}

void wakeupFromLPM2(){
	//printf("HARD WAKE_UP\n");
	cc2520ll_init(1);
	wasLPM2 = 0;
	receiving = 0;//LELE TEST

}


void cc2520ll_shutdown(){
		switchToLPM2();
}

 void cc2520ll_wakeup(void){
		wakeupFromLPM2();
}


/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_config
 *
 * @brief   Power up, sets default tuning settings, enables autoack and
 *                      configures chip IO
 *
 * @param   none
 *
 * @return  SUCCESS if the radio has started, FAILURE otherwise
 */
/*----------------------------------------------------------------------------*/
u8_t
cc2520ll_config(void)
{
  u8_t val;
  u16_t i = 0;

  /* Avoid GPIO0 interrupts during reset */
  P1IE &= ~(1 << CC2520_INT_PIN);

  /* Make sure to pull the CC2520 RESETn and VREG_EN pins low */
  P4OUT &= ~(1 << CC2520_RESET_PIN);
  /* Raise CS */
  P4OUT |= (1 << CC2520_CS_PIN);
  P1OUT &= ~(1 << CC2520_VREG_EN_PIN);


  __delay_cycles(MSP430_USECOND*2000);


  /* Make sure MISO is configured as output */
  P5DIR &= ~(1 << CC2520_MISO_PIN);

  /* Enable the voltage regulator and wait for it (CC2520 power-up) */
  P1OUT |= (1 << CC2520_VREG_EN_PIN);
  __delay_cycles(MSP430_USECOND*CC2520_VREG_MAX_STARTUP_TIME);


  /* Release reset */
  P4OUT |= (1 << CC2520_RESET_PIN);


  /* Wait for XOSC stable to be announced on the MISO pin */
  if (cc2520ll_waitRadioReady()==FAILED) {
	printf("XOSC failed\n");
	//P8OUT |= BIT4;
    return FAILED;
  }
  //printf("XOSC OK writing in mem\n");
  /* Write non-default register values */
  for (i = 0; i < sizeof(regval)/sizeof(regVal_t); i++) {
    CC2520_MEMWR8(regval[i].reg, regval[i].val);
  }

  /* Verify a register */
  val= CC2520_MEMRD8(CC2520_MDMCTRL0);

  //printf("Device configured with val 0x%x\n", val);
  /* Set CS high */
   P4OUT |= (1 << CC2520_CS_PIN);
  return val==0x85? SUCCESS : FAILED;
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_setChannel
 *
 * @brief   Set RF channel in the 2.4GHz band. The Channel must be in the range 11-26,
 *          11= 2005 MHz, channel spacing 5 MHz.
 *
 * @param   channel - logical channel number
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_setChannel(u8_t channel)
{
  CC2520_REGWR8(CC2520_FREQCTRL, MIN_CHANNEL + ((channel - MIN_CHANNEL) * CHANNEL_SPACING));
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_setShortAddr
 *
 * @brief   Write short address to chip
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_setShortAddr(u16_t shortAddr)
{
  CC2520_MEMWR16(CC2520_RAM_SHORTADDR, shortAddr);
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_setShortAddr
 *
 * @brief   Write long address to chip
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_setLongAddr(rimeaddr_t *longAddr)
{
  u16_t i = 0;

  for (i = 0; i < 8; i++) {
        CC2520_MEMWR8(CC2520_RAM_EXTADDR + i, longAddr->u8[7 - i]);
  }
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_setPanId
 *
 * @brief   Write PAN Id to chip
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_setPanId(u16_t panId)
{
  CC2520_MEMWR16(CC2520_RAM_PANID, panId);
}
/*----------------------------------------------------------------------------*/

/**
 * @fn          cc2520ll_init
 *
 * @brief       Initialise cc2520 datastructures. Sets channel, short address and
 *              PAN id in the chip and configures interrupt on packet reception
 *
 *              txState - file scope variable that keeps tx state info
 *
 * @return      none
 */
u16_t
cc2520ll_init(uint8_t wasLPM2)
{
  //close transistor i.e. connect the CC2520 module to vcc
  CC2520_POWER_UP();

  pConfig.panId = ((node_id & 0xFF) << 8) + (node_id >> 8); //RIME address is this
  pConfig.channel = RF_CHANNEL;
  pConfig.ackRequest = FALSE;

  /* initialize spi */
  spi_UCB1_init(0x0002);
  lock_SPI();
  /* initialize the rest of the interface */
  cc2520ll_interfaceInit();


  if (cc2520ll_config() == FAILED) {
	    //P8OUT |=BIT2; //Led 2
	    release_SPI();
        return FAILED;
  }
 if(!wasLPM2)
	  /* initialize the ring buffer */
	  my_ringbuf_init(&rxBuffer, buffer, sizeof(buffer));

  dint();

  /* Set channel */
  cc2520ll_setChannel(pConfig.channel);

  /* Write the short address and the PAN ID to the CC2520 RAM */
  cc2520ll_setPanId(0xABCD);
  cc2520ll_setShortAddr(pConfig.panId);

  /* Set up receive interrupt (received data or acknowledgment) */
  /* Set rising edge */

  P1IES &= ~(1 << CC2520_INT_PIN);
  P1IFG &= ~(1 << CC2520_INT_PIN);
  P1IE |= (1 << CC2520_INT_PIN);



  /* Clear the exception */
    CLEAR_EXC_RX_FRM_DONE();

  /* Enable general interrupts */
  eint();

