zzuzpb/virtual-sense/VirtualSense/platform/virtualsense/dev/_cc2520ll.c
  //printf("Radio device is on\n");
  if(!wasLPM2)
	  process_start(&radio_driver_process, NULL);
  //printf("Driver process started \n");
  //printf("Reception enabled\n");
  return SUCCESS;
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_readRxBuf
 *
 * @brief   Read RX buffer
 *
 * @param   u8_t* pData - data buffer. This must be allocated by caller.
 *          u8_t length - number of bytes
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_readRxBuf(u8_t* pData, u8_t length)
{
  CC2520_RXBUF(length, pData);
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_writeTxBuf
 *
 * @brief   Write to TX buffer
 *
 * @param   u8_t* data - buffer to write
 *          u8_t length - number of bytes
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_writeTxBuf(u8_t* data, u8_t length)
{
  /* Copy packet to TX FIFO */
  CC2520_TXBUF(length, data);
}

/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_transmit
 *
 * @brief   Transmits frame with Clear Channel Assessment.
 *
 * @param   none
 *
 * @return  int - SUCCESS or FAILED
 */
u16_t
cc2520ll_transmit()
{
  u16_t timeout = 2500; // 2500 x 20us = 50ms
  u16_t timeout_RSSI = 250; // 2500 x 20us = 50ms
  u8_t status=0;
#ifdef WITH_FRAME_FILTERING
  cc2520ll_disableSFDInterrupt();
#endif

  //P8OUT &= ~BIT2;
  /* Wait for RSSI to become valid */
  while(--timeout_RSSI > 0){
	  if(CC2520_RSSI_VALID_PIN)
		  break;
	  __delay_cycles(2*MSP430_USECOND);
  }
  //P8OUT |= BIT2;
  /* Wait for the transmission to begin before exiting (makes sure that this
   * function cannot be called a second time, and thereby canceling the first
   * transmission. */
  dint();
  CC2520_INS_STROBE(CC2520_INS_STXONCCA);
  eint();
  while (--timeout > 0) {

    if (CC2520_SAMPLED_CCA_PIN) {
    //if((CC2520_REGRD8(CC2520_FSMSTAT1) & BIT3)){
        break;
    }
    __delay_cycles(20*MSP430_USECOND);
  }
  if (timeout == 0) {
    status = RADIO_TX_ERR;
    //printf("ERROR\n");
    CC2520_INS_STROBE(CC2520_INS_SFLUSHTX);
  } else {
    status = RADIO_TX_OK;
    //printf("TXOK\n");
    /* Wait for TX_FRM_DONE exception */
    //printf("1- 0x%x\n",CC2520_REGRD8(CC2520_EXCFLAG0));
    timeout = 2500;
    while (--timeout > 0) {

       if (CC2520_TX_FRM_DONE_PIN) {
           break;
       }
       __delay_cycles(20*MSP430_USECOND);
     }

    //while(!CC2520_TX_FRM_DONE_PIN);
    if (timeout == 0) {
        status = RADIO_TX_ERR;
        printf("TX_FRM_DONE not received\n");
        CC2520_INS_STROBE(CC2520_INS_SFLUSHTX);
    }
    //printf("TX DONE\n");
    //printf("2- 0x%x\n",CC2520_REGRD8(CC2520_EXCFLAG0));
    dint();
    CC2520_CLEAR_EXC(CC2520_EXC_TX_FRM_DONE);
    eint();
  }

  //printf("This is the transmit status %x\n", status);
  transmitting = 0;
  return status;
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_packetSend
 *
 * @brief   Sends a packet.
 *
 * @param   const void* packet - the packet to be sent.
 * @param   unsigned short len - teh length of the packet to be sent.
 *
 * @return  u8_t - SUCCESS or FAILED
 */
/*----------------------------------------------------------------------------*/
u16_t
cc2520ll_packetSend(const void* packet, unsigned short len)
{
  if (cc2520ll_prepare(packet, len)) {
        return cc2520ll_transmit();
  } else {
        return FAILED;
        last_sleep_time = RTIMER_NOW();
  }
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_prepare
 *
 * @brief   Prepares a packet to be sent.
 *
 * @param   const void* packet - the packet to be sent.
 * @param   unsigned short len - teh length of the packet to be sent.
 *
 * @return  u8_t - SUCCESS or FAILED
 */
/*----------------------------------------------------------------------------*/
u16_t
cc2520ll_prepare(const void *packet, unsigned short len)
{

  /* Check packet length */
  if(wasLPM2)
	  cc2520ll_receiveOn();
  if (len + 3 > MAX_802154_PACKET_SIZE + 1) {
        return FAILED;
  } else {
        /* Wait until the transceiver is idle */
        cc2520ll_waitTransceiverReady();
        /* Turn off RX frame done interrupt to avoid interference on the SPI
         * interface */
        cc2520ll_disableRxInterrupt();
#ifdef WITH_FRAME_FILTERING
        cc2520ll_disableSFDInterrupt();
#endif
        /* Auto crc enabled. The packet will be 2 bytes longer */
        len += 2;
        cc2520ll_writeTxBuf(&len, 1);
        cc2520ll_writeTxBuf(packet, len-2);
        transmitting = 1;

        /* Turn on RX frame done interrupt for ACK reception */
        cc2520ll_enableRxInterrupt();
        // I do not enable SFD interrupt because
        // no frame filtering is applied to ACK
        cc2520ll_receiveOff();
        return SUCCESS;
  }
  }
/*----------------------------------------------------------------------------*/

/**
 * @fn          cc2520ll_channel_clear
 *
 * @brief       Performs a clear channel assesment (CCA)
 * @return      int - 1 if channel clear, 0 otherwise.
 */
u16_t
cc2520ll_channel_clear()
{
  u16_t result;
  /* Reconfigure GPIO1 */
    dint();
    CC2520_CFG_GPIO_OUT(1, CC2520_GPIO_CCA);
    eint();
  while(!CC2520_RSSI_VALID_PIN);

  if (CC2520_CCA_PIN) { //GPIO1 is CCA signal
        result = 1;
  } else {
        result = 0;
  }
  /* restore GPIO 1 behavior */
  dint();
  CC2520_CFG_GPIO_OUT(1, CC2520_GPIO_SAMPLED_CCA);
  eint();
  //printf("^");
  return result;
}
/*----------------------------------------------------------------------------*/

/**
 * @fn          cc2520ll_receiving_packet()
 *
 * @brief       Returns true if a packet is being received (or transmited) in this
 *                         precise moment.
 * @return      int - a number != 0 if a packet is being received or transmited,
 *              0 otherwise.
 */
/*----------------------------------------------------------------------------*/
u16_t
cc2520ll_rxtx_packet()
{
	u16_t value = CC2520_SFD_PIN;
	if(value)
		transmitting = 0;
  return value;
}
/*----------------------------------------------------------------------------*/

/**
 * @fn          cc2520ll_pending_packet
 *
 * @brief       Returns true if there is data to be read in the receive buffer.
 * @return      u8_t - a number != 0 if there isnew data to be read, 0 otherwise.
 */
/*----------------------------------------------------------------------------*/
u16_t
cc2520ll_pending_packet(void)
{
	u16_t value = CC2520_GPIO_FIFOP_PIN;
    if(value)
    	transmitting = 0;
    return value;//my_ringbuf_length(&rxBuffer);
}
/*----------------------------------------------------------------------------*/

/**
 * @fn          cc2520ll_packetReceive
 *
 * @brief       Copies the payload of the last incoming packet into a buffer
 *
 * @param       packet - pointer to data buffer to fill. This buffer must be
 *                        allocated by higher layer.
 *              maxlen - Maximum number of bytes to read from buffer
 *
 * @return      u8_t - number of bytes actually copied into buffer
 */
/*----------------------------------------------------------------------------*/
u16_t
cc2520ll_packetReceive(u8_t* packet, u8_t maxlen)
{
  u8_t len = 0;

  dint();
  if(my_ringbuf_length(&rxBuffer)) {
    my_ringbuf_get(&rxBuffer, &len, 1);
    /* The first byte in the packet is the packet's length */
    /* but it does not count the length field itself */
    if (len > maxlen) {
      my_ringbuf_flush(&rxBuffer);
      len = 0;
    } else {
      len = my_ringbuf_get(&rxBuffer, packet, len);
    }
  }
  eint();
  return len;
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_receiveOn
 *
 * @brief   Turn receiver on
 *
 * @param   none
 *
 * @return  none
 */
void
cc2520ll_receiveOn(void)
{
  //printf("ON\n");
  if(wasLPM2){
	    //printf("WAKEUP RF\n");
		cc2520ll_wakeup();
  }else {
	  //printf("ON RF\n");
  }

