zzuzpb/virtual-sense/VirtualSense/platform/virtualsense/dev/_cc2520ll.c
  CC2520_INS_STROBE(CC2520_INS_SRXON);
  cc2520ll_enableRxInterrupt();
#ifdef WITH_FRAME_FILTERING
  // when a SFD is detected the SFD signal goes high until
  // frame rejection or until RX_FRM_DONE
  // after receiving the SFD interrupt we need to
  // enable falling interrupt to capture the
  // frame rejection event. If SFD goes low and
  // FIFOP is also low the frame is rejected on the other hand
  // if SDF goes low and FIFOP is high the frame is accepted
  cc2520ll_enableSFD_FallingInterrupt();
#endif

}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_receiveOff
 *
 * @brief   Turn receiver off
 *
 * @param   none
 *
 * @return  none
 */
void
cc2520ll_receiveOff(void)
{
  /* wait until we finish receiving/transmitting */
  while(cc2520ll_rxtx_packet());
  cc2520ll_disableRxInterrupt();
#ifdef WITH_FRAME_FILTERING
  cc2520ll_disableSFDInterrupt();
#endif
  CC2520_INS_STROBE(CC2520_INS_SRFOFF); //this will put radio transceiver into LPM1.

#ifdef WITH_CC2520_LPM2
  if(is_locked_MAC()){
	  if((RTIMER_CLOCK_LT(RTIMER_NOW() - last_sleep_time, 1500) && !transmitting)){
		  cc2520ll_shutdown();
		  release_SPI();
	  }else {
		  if(receiving || rejected){
			  cc2520ll_shutdown();
			  release_SPI();
			  rejected = 0;
		  }
		  //printf("DEE %u - %u - %d - %d\n", RTIMER_NOW(), last_sleep_time,transmitting, receiving );

	  }
  }else if(!transmitting){
	  //printf("SHUTDOWN RF\n");
	  cc2520ll_shutdown();
	  release_SPI();
  }
  //}
  last_sleep_time = RTIMER_NOW();
#endif
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_disableRxInterrupt
 *
 * @brief   Clear and disable RX interrupt.
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_disableRxInterrupt()
{
  /* Clear the exception and the IRQ */
  CLEAR_EXC_RX_FRM_DONE();
  P1IFG &= ~(1 << CC2520_INT_PIN);
  P1IE &= ~(1 << CC2520_INT_PIN);
  //printf("Interrupt disabled\n");
}
/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_enableRxInterrupt
 *
 * @brief   Enable RX interrupt.
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_enableRxInterrupt()
{
  P1IE |= (1 << CC2520_INT_PIN);
}
/*----------------------------------------------------------------------------*/

#ifdef WITH_FRAME_FILTERING

/**
 * @fn      cc2520ll_enableSFD_Rising_Interrupt
 *
 * @brief   Enable SFD rising interrupt.
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_enableSFD_RisingInterrupt()
{
	  P1IES &= ~(1 << CC2520_SFD_INT_PIN);
  	  P1IFG &= ~(1 << CC2520_SFD_INT_PIN);
  	  P1IE |= (1 << CC2520_SFD_INT_PIN);
}

/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_enableSFD_Falling_Interrupt
 *
 * @brief   Enable SFD falling interrupt.
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_enableSFD_FallingInterrupt()
{
	  P1IES |= (1 << CC2520_SFD_INT_PIN);
	  P1IFG &= ~(1 << CC2520_SFD_INT_PIN);
	  P1IE |= (1 << CC2520_SFD_INT_PIN);
}

/*----------------------------------------------------------------------------*/

/**
 * @fn      cc2520ll_disableSFD_Interrupt
 *
 * @brief   Clear and disable SFD interrupt.
 *
 * @param   none
 *
 * @return  none
 */
/*----------------------------------------------------------------------------*/
void
cc2520ll_disableSFDInterrupt()
{
  P1IFG &= ~(1 << CC2520_SFD_INT_PIN);
  P1IE &= ~(1 << CC2520_SFD_INT_PIN);
}

/*----------------------------------------------------------------------------*/
#endif // ifdef WITH_FRAME_FILTERING
/**
 * @fn          cc2520ll_packetReceivedISR
 *
 * @brief       Interrupt service routine for received frame from radio
 *              (either data or acknowlegdement)
 *
 * @return      none
 */
/*----------------------------------------------------------------------------*/
interrupt(PORT1_VECTOR)
cc2520ll_packetReceivedISR(void)
{
  cc2520ll_packetHdr_t *pHdr;
  u8_t *pStatusWord;
  signed char last_rssi = 0;
  u8_t last_correlation = 0;
#ifdef WITH_FRAME_FILTERING
  // check if the interrupt belong from port 1.1 --> GPIO3 SFD signal
  // and is rising ( start of frame delimiter reception in order to measure time between
  // SFD high and SFD low. In pure frame filtering (no measure) the only SFD low detection is needed
  // if SDF is falling check FIFOP signal to decide if shutdown the transceiver (rejection of frame).
  //dint();
  if(P1IV == P1IV_P1IFG1){
	  // SFD is falling
	  if(!CC2520_GPIO_FIFOP_PIN){ // FIFOP is low
		  // frame rejected
		  cc2520ll_disableSFDInterrupt();
		  transmitting = 0;
		  receiving = 0;
		  eint();
		  rejected = 1;
		  process_poll(&radio_driver_process);
		  LPM4_EXIT;
		  return 1;
	  }else { // FIFOP is high frame accepted
		  cc2520ll_disableSFDInterrupt();
		  return 1;
	  }
  }
  eint();
#endif
  /* end frame filtering */

  /* Map header to packet buffer */
  pHdr = (cc2520ll_packetHdr_t*)rxMpdu;
  /* Clear interrupt and disable new RX frame done interrupt */
  dint();
  cc2520ll_disableRxInterrupt();

  /* Read payload length. */
  cc2520ll_readRxBuf(rxMpdu, 1);
  /* Ignore MSB */
  rxMpdu[0] &= CC2520_PLD_LEN_MASK;
  pHdr->packetLength = rxMpdu[0];

  /* Is this an acknowledgment packet? */
  /* Only ack packets may be 5 bytes in total. */
  //if (pHdr->packetLength != CC2520_ACK_PACKET_SIZE) { //LELE: problems ACK is not put on the rxBuffer
    /* It is assumed that the radio rejects packets with invalid length.
     * Subtract the number of bytes in the frame overhead to get actual
     * payload */
    cc2520ll_readRxBuf(&rxMpdu[1], pHdr->packetLength);
    /* Read the FCS to get the RSSI and CRC */
    pStatusWord = rxMpdu + pHdr->packetLength + 1 - 2;
    /* Notify the application about the received data packet if the CRC is OK */
    if(pStatusWord[1] & CC2520_CRC_OK_BM) {
      /* All ok; copy received frame to ring buffer */
          my_ringbuf_put(&rxBuffer, rxMpdu, rxMpdu[0] + 1);
          last_rssi = pStatusWord[0]-76;
          last_correlation = pStatusWord[1]&0x7F;
          packetbuf_set_attr(PACKETBUF_ATTR_RSSI, last_rssi);
          packetbuf_set_attr(PACKETBUF_ATTR_LINK_QUALITY, last_correlation);
          //printf("RSSI %d --- %x %u - CORR %x\n",last_rssi,  pStatusWord[0], pStatusWord[0], pStatusWord[1]&0x7F);
    }else {
    	//printf("CRC not OK\n");
    	//P8OUT |= BIT1;
    }
    //P8OUT &= ~BIT1;
    /* Flush the cc2520 rx buffer to prevent residual data */
      CC2520_SFLUSHRX();
  //}else {
	//  printf("packet lenght == ACK_SIZE\n");
  //}
  /* Enable RX frame done interrupt again */
  cc2520ll_enableRxInterrupt();
  eint();
  transmitting = 0; //LELE: experiments
  receiving = 1;
  printf("-\n");
  /* Clear interrupt flag */
  P1IFG &= ~(1 << CC2520_INT_PIN);
  process_poll(&radio_driver_process);
  //EXIT LPM3/4
	LPM4_EXIT;
    return 1;
}
/*----------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------*/
PROCESS_THREAD(radio_driver_process, ev, data)
{
  int len;
  PROCESS_BEGIN();

  printf("cc2520_process: started\n");

  while(1) {
    PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);
    last_packet_timestamp = clock_time(); //TODO: set correct timestamp by means of interrupt routine
    //printf("cc2520_process: calling receiver callback\n");
    packetbuf_clear();
    packetbuf_set_attr(PACKETBUF_ATTR_TIMESTAMP, last_packet_timestamp);
    len =  cc2520ll_packetReceive(packetbuf_dataptr(), PACKETBUF_SIZE) - 2;
    packetbuf_set_datalen(len);
    NETSTACK_RDC.input();
  }
  PROCESS_END();
}
/*---------------------------------------------------------------------------*/

